W8D1/reddit_clone/app/views/posts/_form.html.erb

SELECT "subs".* FROM "subs"
---
    <p></p>
        <% Sub.all.each do |sub| %>