W8D1/reddit_clone/app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]
---

<% post.subs.each do |sub| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 4]]
---
<h2>Comments</h2>
<% comments = post.comments.where(parent_comment_id: nil) %>