W8D1/reddit_clone/app/views/posts/show.html.erb

<h2>Comments</h2>
<% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]