W8D1/reddit_clone/app/controllers/application_controller.rb

    def require_moderator!
        redirect_to subs_url if current_user != Sub.find_by(id: params[:id]).moderator
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]