W8D1/reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "aabbccdd"], ["author_id", 2], ["post_id", 4], ["created_at", "2020-07-25 08:33:31.742811"], ["updated_at", "2020-07-25 08:33:31.742811"], ["parent_comment_id", 1]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save