W8D1/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hahahha"], ["url", ""], ["content", "aweifou"], ["author_id", 3], ["created_at", "2020-07-25 04:37:19.044220"], ["updated_at", "2020-07-25 04:37:19.044220"]]
---
    def create
        @post = Post.new(post_params)
        if @post.save