W8D1/reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "aaaaawef"], ["updated_at", "2020-07-25 03:43:56.807185"], ["id", 3]]
---
    def update
        @sub = Sub.find_by(id: params[:id])

        if @sub.update(sub_params)