W6D4/rails-router/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1  [["author_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
---
    def index

        if comment_params.has_key?(:author_id)
            @comments = Comment.where(author_id: comment_params[:author_id])
        elsif comment_params.has_key?(:artwork_id)
            @comments = Comment.where(artwork_id: comment_params[:artwork_id])