W6D4/rails-router/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE 'datuotuo')
SELECT "users".* FROM "users"
---
    def index
        if params.has_key?(:username)
            name = params[:username]
            user = User.where('username LIKE ?', name)
            render json: user
        else
            render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "thomasisbendan@gmail.com"], ["updated_at", "2020-07-14 02:22:28.078927"], ["id", 5]]
---
    def update
        user = User.find_by_id(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
    def destroy
        user = User.find_by_id(params[:id])
       if user.destroy