W6D5_2/cats_99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "gender", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Toma"], ["description", "        TOMA!\r\n    "], ["updated_at", "2020-07-16 08:14:39.967968"], ["id", 2]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)