W7D2/music_app/app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
    def index
        @albums = Album.where(band_id: params[:band_id])

INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 2], ["title", "Mao Wang"], ["year", 1999], ["live", true], ["created_at", "2020-07-20 08:53:03.607143"], ["updated_at", "2020-07-20 08:53:03.607143"]]
---
    def create
        @album = Album.new(album_params)

        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "band_id" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "Mao Wang"], ["band_id", 2], ["updated_at", "2020-07-20 09:44:12.832289"], ["id", 1]]
---
    def update
        @album = Album.find_by(id:params[:id])

        if @album.update(album_params)