W7D2/music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "GL5jJ498skKfDrbYU1kdjA"], ["LIMIT", 1]]
---
    def current_user
        return nil if self.session[:session_token].nil?
        @current_user ||= User.find_by(session_token: session[:session_token] )