W7D2/music_app/app/controllers/bands_controller.rb

    def index
        @bands = Band.all
---
SELECT  "bands".* FROM "bands" WHERE (index) LIMIT $1  [["LIMIT", 1]]

    def find_band
        Band.find_by(id:params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]