W7D2/music_app/app/views/albums/_form.html.erb

        <option value="" disabled  <%= method == :post ? "selected" : "" %> >--Please choose an option--</option>
        <% bands = Band.all %>
---
SELECT "bands".* FROM "bands"