W7D2/music_app/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <% band_id = album.band_id %>
        name: <%= Band.find(band_id).name %>