W6D3_2/rails-router/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "thomasisbendan@gmail.com"], ["updated_at", "2020-07-14 02:22:28.078927"], ["id", 5]]
---
    def update
        user = User.find_by_id(params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
---
    def destroy
        user = User.find_by_id(params[:id])
       if user.destroy